tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "sass/sass"
tap "teamookla/speedtest"
# Search tool like grep, but optimized for programmers
brew "ack"
# Automatic configure script builder
brew "autoconf"
# Vector graphics library with cross-device output support
brew "cairo"
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Gatsby command-line interface
brew "gatsby-cli"
# GNOME XML library
brew "libxml2"
# Optimized BLAS library
brew "openblas"
# Geospatial Data Abstraction Library
brew "gdal"
# Manage compile and link flags for libraries
brew "pkg-config"
# JavaScript Task Runner
brew "grunt-cli"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php", restart_service: true
# Software environment for statistical computing
brew "r"
# File system client based on SSH File Transfer Protocol
# brew "sshfs"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Unidata unit conversion library
brew "udunits"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Web browser focusing on privacy
cask "brave-browser"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
# cask "docker"
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# cask "lando"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
cask "microsoft-teams"
# Web browser
cask "opera"
# File system integration
# cask "osxfuse"
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
# Environment for statistical computing and graphics
cask "r"
# Data science software focusing on R and Python
cask "rstudio"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
