tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "pantheon-systems/external"
tap "sass/sass"
tap "teamookla/speedtest"
# Search tool like grep, but optimized for programmers
brew "ack"
# Automatic configure script builder
brew "autoconf"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Vector graphics library with cross-device output support
brew "cairo"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Fast and simple Node.js version manager
brew "fnm"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Gatsby command-line interface
brew "gatsby-cli"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNOME XML library
brew "libxml2"
# Optimized BLAS library
brew "openblas"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# JavaScript Task Runner
brew "grunt-cli"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LLM inference in C/C++
brew "llama.cpp"
# Create, run, and share large language models (LLMs)
brew "ollama"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Software environment for statistical computing
brew "r"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Version control system designed to be a better CVS
brew "subversion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Unidata unit conversion library
brew "udunits"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"
# Terminus is Pantheon's Command-line Interface (CLI)
brew "pantheon-systems/external/terminus"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Web browser focusing on privacy
cask "brave-browser"
# Server and cloud storage browser
cask "cyberduck"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Get up and running with large language models locally
cask "ollama-app"
# Web browser
cask "opera"
# PHP IDE by JetBrains
cask "phpstorm"
# Collaboration platform for API development
cask "postman"
# Environment for statistical computing and graphics
cask "r-app"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
vscode "anthropic.claude-code"
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "shd101wyy.markdown-preview-enhanced"
